ru = {
    'enter': 'Введите',
    'press_to_continue': 'нажмите для продолжения',
    'main_menu': {
        'add_record': ' - для добавления записи',
        'edit_record': ' - для изменения записи',
        'delete_record': ' - для удаления записи',
        'search_for_record': ' - для поиска записи',
        'show_phonebook': ' - для отображения справочника',
        'import_from_file': ' - для импорта данных из файла',
        'export_to_file': ' - для экспорта данных в файл',
        'exit': ' - для выхода из программы'
    },
    'record': {
        'name': 'Имя',
        'surname': 'Фамилия',
        'phone_no': 'Номер телефона',
        'desc': 'Описание'
    },
    'search': 'Введите имя или фамилию',
}