ru = {
    'enter': 'Введите',
    'press_to_continue': 'нажмите для продолжения',
    'search': {
        'type_request': 'Введите имя или фамилию',
        'found_records': 'Найденные записи:'
    },
    'main_menu': {
        'add_record': ' - для добавления записи',
        'edit_record': ' - для изменения записи',
        'delete_record': ' - для удаления записи',
        'search_for_record': ' - для поиска записи',
        'show_phonebook': ' - для отображения справочника',
        'import_from_file': ' - для импорта данных из файла',
        'export_to_file': ' - для экспорта данных в файл',
        'exit': ' - для выхода из программы'
    },
    'record': {
        'name': 'Имя',
        'surname': 'Фамилия',
        'phone_no': 'Номер телефона',
        'desc': 'Описание'
    },
    'file': {
        'import': 'имя файла для импорта',
        'export': 'имя файла для экспорта'
    },
    'error': {
        'too_many_records': 'Найдено более одной записи, уточните поиск, пожалйста'
    }
}